#include<std_lib_facilities.h>

int main()
{
	setlocale(LC_ALL,"Russian");
	cout << "#include - директива, включающая текст заголовочного файла\n"
			"указанного в угольных скобках в программу\n";
	cout << "// - коментарий, часть исходного кода не обрабатываемая компилятором";
	cout << "<< - оператор вывода";
	cout << "С++ - язык программирования";
	cout << "cout - поток вывода символов";
	cout << "IDE - интегрированная среда разработки";
	cout << "main() - основная функция с которой начинается \nобработка исходного кода в C++";
	cout << "библиотека - набор готовых функций и данных, для \nоблегчения программирования";
	cout << "вывод - ";
	cout << "выполняемый файл - ";
	cout << "заголовок - текстовый файл, содержащий определения фунуций";
	cout << "инструкция - ";
	cout << "исходный код - набранная программа до компиляции";
	cout << "комментарий - часть исходного кода, назначение которой описание того или иного модуля или целой программы";
	cout << "компилятор - программа предназначенная для преобразования исходного в объектный код";
	cout << "объектный код - программа в виде понятном для компьютера";
	cout << "ошибка времени компиляции - ошибка возникающая в процессе компиляции";
	cout << "программа - набор инструкций для управлением компьютером";
	cout << "редактор связей - программа предназначенная для соединения объектных кодов";
	cout << "функция - набор инструкций выполняющий определенные действия";
	keep_window_open();
	return 0;
}