/*
   Файл               : StdAfx.h

   Проект             : любой проект, использующий библиотеку
                        классов MFC 

   Назначение         : стандартный включаемый файл для
                        прекомпиляции (результаты компиляции в
                        папке Debug в файле .PCH)

   Microsoft Visual Studio C++ .NET 2005
*/

// Предотвращение возможности многократного подключения данного
//   файла
#ifndef _StdAfx_h
    #define _StdAfx_h

    // Здесь следует подключить все стандартные (неизменяемые)
    //  заголовочные файлы большого размера
    #include <afxwin.h>             // Ядро MFC и стандартные
                                    //   компоненты
    //#include <afxcmn.h>             // Общие управляющте элементы
    //#include <afxdlgs.h>            // Диалоги MFC
    //#include <afxext.h>             // Классы расширений MFC
    //#include <afxmt.h>              // Многопоточность MFC
    //#include <afxres.h>             // Ресурсы MFC

#endif
